CPS-Projet/spec/gestionCombat.org
* GestionCombat
** service : GestionCombat
** use : [[file:terrain.org][Terrain,]] [[file:personnage.org][Personnage]], [[file:position.org][Position]]
** types : String, int, boolean, List<Personnage>, Map<String,Personnage>, Map<String,COMMANDE>, enum COMMANDE {RIEN, GAUCHE, DROITE, HAUT, BAS, SAUTER, FRAPPE, JETER, RAMASSER}
  

** observators :
**** terrain : [GestionCombat] → Terrain

**** mPerso : [GestionCombat] → Map<String,Personnage>

**** estFrappe : [GestionCombat] × String → boolean
***** pre estFrappe(C,id) require id ∈ mPerso.keySet()

**** estGele : [GestionCombat] × String → boolean
***** pre estGele(C,id) require id ∈ mPerso.keySet()

**** cptGele : [GestionCombat] × String → int
***** pre cptGele(C,id) require id ∈ mPerso.keySet() ∧ estGele(C,id)

**** position : [GestionCombat] × String → Position
***** pre position(C,id) require id ∈ mPerso.keySet() 

**** collisionGauche : [GestionCombat] × String × String → boolean
***** pre collisionGauche(C,id1,id2) require  id1 ∈ mPerso.keySet() ∧ id2 ∈ mPerso.keySet() 

**** collision : [GestionCombat] × String → List<Personnage>
***** pre collision(C,id) require id ∈ mPerso.keySet() 



** Constructors :
**** init : int × int × int → [GestionCombat]




** Operators :
**** gerer : [GestionCombat] × Map<String,COMMANDE> → [GestionCombat]




** Observations :
*** [invariants]
**** collision(C, id) =min 
***** tmp = ∅, ∀nomP ∈ mPerso.keySet(),
***** tmp ⋃ nomP si collisionGauche(C,id,nomP) || collisionGauche(C,nomP,id) 

**** collisionGauche(C,id1,id2) =min
# v3
***** pos1 = position(C, id1), pos2 = position(C, id2),
***** Position::collision(pos1, pos2)


# v2
# ***** pos1 = position(C, id1), pos2 = position(C, id2),
# ****** (pos1[0.] ⩽ pos2[0.] ⩽ pos1[0.] + 1) ∧ 
# ****** (pos1[1.] = pos2[1.]) ∧ 
# ****** (pos1[2.] = pos2[2.]) 

# v1
# ***** dX = Personnage::largeur(mPerso.get(id1))/2 + Personnage::largeur(mPerso.get(id2))/2, 
# ***** dY = Personnage::profondeur(mPerso.get(id1))/2 + Personnage::profondeur(mPerso.get(id2))/2, 
# ***** dZ = Personnage::hauteur(mPerso.get(id1))/2 + Personnage::hauteur(mPerso.get(id2))/2, 
# ***** si ↓ alors [id1,id2] sinon []
# ****** (-dX ⩽position(C,id2)[0.] - position(C,id1)[0.] ⩽ dX+1) 
# ****** ∧ (-dY ⩽position(C,id2)[1.] - position(C,id1)[1.] ⩽ dY+1) 
# ****** ∧ (-dZ ⩽position(C,id2)[2.] - position(C,id1)[2.] ⩽ dZ+1)








*** [init]
**** terrain(init(l,h,p)) = Terrain::init(l,h,p)

**** mPerso(init(l,h,p)) = 
***** mPerso.put("Alex", Personnage::init("Alex",20,51,10,100,1664)) 
***** mPerso.put("Ryan", Personnage::init("Ryan",25,60,12,200,1664)) 
***** mPerso.put("Slick", Gangster::init("Slick",35,80,20,250,2000))
***** + 3 gangster lambda :
****** name = RandomName()
****** mPerso.put(name, Gangster::init(name,18,45,9,50,500))

**** estFrappe(init(l,h,p),id)=false

**** estGele(init(l,h,p),id)=false

**** position
***** position(init(l,h,p),"Alex") = Position::init(0, Terrain::profondeur(init(l,h,p)) / 2 + 1, 0, false)
***** position(init(l,h,p),"Ryan") = Position::init(0, Terrain::profondeur(init(l,h,p)) / 2 - 1, 0, false)
***** position(init(l,h,p),"Slick") = Position::init(Terrain::largeur(init(l,h,p)) - 1, Terrain::profondeur(init(l,h,p)) / 2, 0, true)
***** position(init(l,h,p), id) = Random sur Bloc Vide 






*** [gerer]
**** TODO id n'appartient pas a keySet, creation d'un gangster
****  ∀id ∈ mPerso.keySet(), mPerso(gerer(C, cmd)).get(id) =  
***** si ¬estFrappe(gerer(C, cmd),id) alors mPerso(C).get(id)
***** sinon Personnage::retrait(mPerso(C).get(id),cpt)
****** avec cpt=0, ∀p ∈ collision(C,id), cmd.get(Personnage::nom(p)) == FRAPPE, cpt += Personnage::force(p) 

**** ∀id ∈ mPerso.keySet(), estFrappe(gerer(C, cmd), id) =
***** collision(C,id) ≠ ∅ ∧ (∃p ∈ collision(C,id) tq cmd.get(Personnage::nom(p)) == FRAPPE)

**** ∀id ∈ mPerso.keySet(), estGele(gerer(C, cmd), id) = (cmd.get(id) == FRAPPE) ∨ estFrappe(gerer(C, cmd), id) ∨ Chose::estPorte(mPerso(gerer(C, cmd)).get(id)) ∨ (estGele(C, id) ∧ cptGele(C, id) > 1)

**** ∀id ∈ mPerso.keySet(), cptGele(gerer(C, cmd), id) = 
***** si (cmd.get(id) == FRAPPE) alors 1 
***** sinon si estFrappe(gerer(C, cmd), id) alors 3
***** sinon cpt(C, id)-1

**** mPerso.keySet(), position(gerer(C, cmd), id) =
***** si estFrappe(gerer(C, cmd), id), 
****** si (∃p ∈ collisionGauche(C,id,p) tq cmd.get(Personnage::nom(p)) == FRAPPE) alors 
******* Position::setX(position(C, id), min(Position::x(position(C, id)) + 3, Terrain::largeur(terrain(C))))
****** si (∃p ∈ collisionGauche(C,p,id) tq cmd.get(Personnage::nom(p)) == FRAPPE) alors 
******* Position::setX(position(C, id), max(Position::x(position(C, id)) - 3, 0))

***** si Chose::estPorte(mPerso(C).get(id)) alors 
****** ∃p ∈ mPerso(C).keySet() tq Personnage::laChoseEquipee(p) == mPerso(C).get(id) ∧ cmd.get(Personnage::nom(p)) ≠ JETER
******* Position::set(position(C, id), position(C, p))
****** ∃p ∈ mPerso(C).keySet() tq Personnage::laChoseEquipee(p) == mPerso(C).get(id) ∧ cmd.get(Personnage::nom(p)) == JETER
******* si Position::dirG(position(gerer(C, cmd), p)) alors Position::set(position(C, id), Position::x(max(position(C, p) - 5, 0)), Position::y(position(C, p)), 0) 
******* sinon Position::set(position(C, id), Position::x(min(position(C, p) + 5, Terrain::largeur(terrain(C))), Position::y(position(C, p)), 0) 

***** si cmd.get(id) == DROITE
******* Position::setX(position(C, id), min( Position::x(position(C, id)) + 1, Terrain::largeur(terrain(C))))
******* Posirion::setDir(position(C, id), false);

***** si cmd.get(id) == GAUCHE
******* Position::setX(position(C, id), max( Position::x(position(C, id)) - 1, 0))
******* Posirion::setDir(position(C, id), true);

***** si cmd.get(id) == HAUT
******* Position::setY(position(C, id), min( Position::y(position(C, id)) + 1, Terrain::profondeur(terrain(C))))

***** si cmd.get(id) == BAS
******* Position::setY(position(C, id), max( Position::y(position(C, id)) - 1, 0))

***** si cmd.get(id) == SAUTER
******* Position::setZ(position(C, id), 1)

***** sinon 
******* Position::setZ(position(C, id), 0)
